app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "course_code", "course_type", "teaching_type", "exam_type", "credit", "limit_num", "student_num", "classroom", "course_time", "course_week", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save